notes.tex
% Created 2019-09-21 Sat 21:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[a4paper, margin=2cm]{geometry}
\usepackage{indentfirst}
\usepackage[, brazilian]{babel}
\usepackage{float}
\usepackage{color, colortbl}
\usepackage{titling}
\setlength{\droptitle}{-1.5cm}
\hypersetup{ colorlinks = true, urlcolor = blue }
\definecolor{beige}{rgb}{0.93,0.93,0.82}
\definecolor{brown}{rgb}{0.4,0.2,0.0}
\author{Fernanda Guimarães}
\date{}
\title{Notes LP}
\hypersetup{
 pdfauthor={Fernanda Guimarães},
 pdftitle={Notes LP},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={Brazilian}}
\begin{document}

\maketitle
\section{(05/08/19) What are programming languages?}
\label{sec:org1b120a6}
Programming languages are turing complete. Html  is not a programming language. Assembly is.
The formal definition is:
\begin{itemize}
\item Syntax
\item Semantics
\item 
\end{itemize}

Words are easier to remember than numbers.

\subsection{Fortran}
\label{sec:org87383df}
IBM. It brought two news:
\begin{itemize}
\item There are variables
\item Control structures (loops, conditionals).
\end{itemize}

Parsing: read a chain of characters and transform it into a data structure (a tree).

\subsection{Lisp}
\label{sec:org8136c3e}
Paretheses.

Based on mathematical functions and lists.

News:  no need for parsing, built on linked lists.

\subsection{ALGOL}
\label{sec:org71787fa}
Two news:
\begin{itemize}
\item Type notation
\item Begin and end
\end{itemize}

\subsection{COBOL}
\label{sec:org191849d}
Grace Hopper.

Looks like a natural language.

\subsection{How many are there?}
\label{sec:org96bebe5}
O'Reilly says that there are 2500, wikipedia says 650. Java is the most popular
(portability).

\subsubsection{Different purposes}
\label{sec:org34c8722}
\begin{itemize}
\item Fortan: scientific calculus
\item Lisp: computer theory
\item COBOL: comercial applications
\item Algol: academic languages
\end{itemize}

\subsection{C}
\label{sec:org40b2358}
Denis Reed

It was made to finish UNIX.

It's popular because the compiler already came with UNIX.

\subsection{PHP}
\label{sec:org9b6aaa0}
Recursive name.

Useful for web servers.

Came to supply the need for Pearl.

Came with Apache, not efficient.

\section{(07/08/19) Types of languages}
\label{sec:org899b9bd}
State = memory

Parsing = produce derivation trees for some chain of characters.

A program in x86 is a set of instructions.

Prolog isn't a patternized language. 

\subsection{Imperatives (state)}
\label{sec:orgfd07550}
Turing machines.

\begin{itemize}
\item C
\item Cpp
\item Java
\item Python
\item C\#
\end{itemize}
\subsection{Declaratives (stateless)}
\label{sec:org885df56}
There are no steps.
\subsubsection{Functionals}
\label{sec:org67ef567}
Lambda calculus.
\begin{itemize}
\item ML
\item Haskell
\item Lisp
\item Erlang
\item Elixir
\item Scala
\item Clojure
\end{itemize}
\subsubsection{Logicals}
\label{sec:orgf4a9181}
Horn clause.
\begin{itemize}
\item Prolog
\item Datalog
\end{itemize}
\subsection{Grammars}
\label{sec:org9f555d5}
\begin{itemize}
\item Tokens (terminals)
\item Non-terminals (variables)
\item Production rules
\item Start symbol
\end{itemize}
\subsubsection{Types}
\label{sec:org92e5f01}
\begin{itemize}
\item Regulars: super fast.
\item Context-free: can only have a symbol on the left side of production.
\item Context-sensitive: many symbols (right side is bigger or equal to left side).
\item Irrestricted grammar: Turing Machines.
\end{itemize}
\section{(12/08/19) Precedence}
\label{sec:org4c13d71}
Parsing is used in compilers, valgrind, static verification, etc.
There are two semantics aspects of languages:
\begin{itemize}
\item Associativity
\item Precedence
\end{itemize}

In C, there are unary, binary and ternary operators. The closer to the roots, bigger the precedence.

Attribution is associative to the right.
\section{(14/08/19) Compilation}
\label{sec:org48b917b}
Search for: arithmetic identities of gcc.

Programming languages are usually compiled (ex assembly), virtualized (ex python) or
interpreted (ex bash).

Virtualized are compiled to a virtual machine.

\subsection{Why are some programs interpreted, others interpreted and others virtualized?}
\label{sec:org620976b}
Because of efficiency. It's better to compile the program when the execution time is
really large.
\subsection{Compilation}
\label{sec:org2d1a1e5}
The classical Sequence:
[editor] --> source file --> [preprocessor] --> preprocessed source file
--> [compiler] --> assembly language file --> [assembler] -->
object file --> [linker] --> executable file -->
[loader] --> running program in memory

\section{(19/08/19) Introduction to ML}
\label{sec:org412602a}
Important: an algoritm that in C has less complexity than in ML.
There isn't implicit coersion. Everything is explicit.

Declarative Functional language. Follows the lambda-calculus. Program \textbf{is} a value, and
not a sequence of state alterations. Every program in ML has a type. A bunch of
functional languages have type inference.

Built around \emph{unification}.

The five primitive types are: bool, int, real, char and string.

You can't compare real and int, but you can convert one to another.

Every if has an else, because every program is a value.

Functions have a very high precedence.

\subsection{Tuples: cartesian product}
\label{sec:org76b4ca7}
Tuples are indexed by 1. There are no one-element tuples.

Every fun in ML receives only \textbf{one} parameter.

Type contructor = '*'. It's like a fun that receives types and returns types. It's like
generics in Java and templates in cpp.

\subsection{Lists}
\label{sec:orgf68e31c}
Read head and read tail in O(1), same types.
\begin{itemize}
\item\relax [1,2,3];
\end{itemize}
\emph{val it = [1,2,3] : int list}
\begin{itemize}
\item\relax [1.0,2.0];
\end{itemize}
\emph{val it = [1.0,2.0] : real list}

@ is O(n). :: is O(1) and associated to the right.

\emph{Explode} splits a string into a list of chars.

If the '\(=\)' operator appears in a definition of a fun, then real numbers cannot be used.

You can force a fun to be real (it can come in several places):

\emph{fun prod(a,b):real = a * b;}

The output of the type inference can be exponential.
\section{(21/08/19) Pattern matching in ML}
\label{sec:orgeddc13e}
Undescores are better than a variable that is never going to be used.
Two '' mean there are no real numbers.
\section{(26/08/19) Type}
\label{sec:org889cd06}
Types are a set of values. Brainfuck and Forth don't have types. Type systems avoid some
erros.

Advantages:
\begin{itemize}
\item Documentation
\item Safety
\item Efficiency
\item Correctness
\end{itemize}

In C, the size depends of the compiler. R is a language for array manipulation, so is
matlab and APL.

\subsection{Primitive vs Constructed}
\label{sec:orgf3ca2fc}
Primitive is built-in. Constructed types are just sets built from other sets.

You can make constructed types by cartesian product, for example.

In C, an enumeration is a subset of ints. Structs are stored sequentially.

In Ml, you can only do a \emph{comparison} with an enumeration.

The cardinality of a type is the product of its types cardinalities.

\subsection{Vectors}
\label{sec:org12c2205}
Three abstractions: lists, vectors and strings.

Vectors are a multidimensional cartesian product of the same set (same type).

\subsection{Union}
\label{sec:org2b1237d}
The cardinality is the \emph{sum} of the cardinality of its types. The space occupied is the
largest element's size.
\subsection{Functions}
\label{sec:org60caad3}
A map that maps the domain to a range. In C, you can pass a function as a parameters
with a address.
\subsection{Static vs Dyamic Typing}
\label{sec:orga470220}
\begin{itemize}
\item Static examples: C, Java, \emph{SML}, Cpp, Haskell.
\item Dynamic examples: Python, Javascript, Lisp, PHP, Ruby.

Static are more efficient. Bigger programs tend to be written in statically typed
languages. Are more legible.

Dynamically typed typed languages are more reusable. This kind of reuse is called
duck typing.
\end{itemize}

\subsection{Strongly vs weakly typed}
\label{sec:org8badb1c}
A strongly typed language guarantees that a type will be always used as declared.

\begin{itemize}
\item Strongly: haskell, ml.
\item Weakly: c, cpp. Ex: unions, coersion, idexing. Advantage: performance.
\end{itemize}

\section{(28/08/19) Polymorfism}
\label{sec:org3d6a924}
