notes.org
** Strategies to discover types
  - Implicit: types are inferred.
    - Inference: the compiler uses an algorithm that finds the correct type of
      each value. Examples: Haskell, Scala, SML.
    - Special names: In some old languages, the name of the variable gives away
      its type. Example: in old Fortran, integer variables should start with 'I'.
  - Explicit: syntax determines types.
    - Annotations: the programmer must explicitly write the type of a symbol
      next to it. Examples: Java, C, C++.

** Equivalence:
   - name equivalence: two types are the same, if, and only if, they have the
     same name: C, Java, C++, etc. Advantage: legibility.
   - structural equivalence: two types are the same if they have the same
     structure. Example: SML. Advantage: reusability.

** Polymorfism
   Python is way more reusable than C or SML. The secret to get closer to Python is
   polymorfism. A function or operator is *polymorphic* if it has at least two possible
   types.

   Which statically typed language gets closer to python? Two types of polymorfism:
   - ad-hoc (infinite symbols)
   - universal
*** Ad-hoc
    - Overload. Uses the types to choose the definition.
    - Coersion. Uses the definition to choose a type conversion.
**** Overload:
     An overloaded function name or operator is one that has at least two definitions, all
     of different types. Many languages have overloaded operators. There are languages
     that allow the programmer to change the meaning of operators.

**** Coersion:
     A coercion is an implicit type conversion, supplied automatically even if the
     programmer leaves it out.
*** Universal
    - Parametric
    - Subtyping
**** Subtyping:
     Barbara Liskov's principle. Subtyping *isn't* the same as inheritance. Not the only
     mecanism to create subptypes.

* (02/09/19) Lambda calculus
** Lambda expressions:  

   Each lambda declares a different name.
  
   #+begin_example
   <expr> ::= <name>
         | \lambda <name> . <expr> |
         | <expr> <expr>           |

   #+end_example   
  

   \[(\lambda x \cdot x) \cdot w\], where


   #+begin_export latex
   \begin{align*}     
     & x_0 = \text{formal parameter} \\
     & x_1 = \text{function body} \\
     & w   = \text{real parameters} \\
   \end{align*}
   #+end_export
         
** Numbers
   A number is a function that takes a function s plus a constant z. The
   number N is formed by applying s N times on z.
   #+begin_example
   Zero = \s.\z.z
   One = \s.\z.sz
   Two = \s.\z.s(sz)
   Three = \s.\z.s(s(sz))
   #+end_example
* (04/09/19) Currying and Higher order
** Currying
   Then it is not possible to implement a function which take multiple parameters? Of
   course, it is possible, by a methodology called currying.In currying every function
   takes only one argument and returns a function. While the last function in this series
   will return the desired output.

** Anonymous Functions
   Starts with /fn/ (lambda functions). You can't do a recursive anonymous function because
   it doesn't have a name. For you to do one, you need the /y combinator/.

   In SML, we can create anonymous functions, e.g: (fn x => x + 2) 3.

   'fn' is the equivalent of lambdas in SML, e.g:
   \x.x is equivalent to fn x => x

   - val ZERO = fn s => fn z => z;
   - val ONE = fn s => fn z => s z;
   - val TWO = fn s => fn z => s (s z);
   - val THREE = fn s => fn z => s (s (s z));

** Higher Order
   Each function has an order:
   - A function that does not take other functions as parameters, and does not return a
     function value, has order 1
   - A function that takes a function as a parameter or returns a function value has order
     n+1, where n is the order of its highest-order parameter or returned value     
**** Foldr and Foldl
     Only return the same when operators are both associative and commutative.
* (11/09/19) Data Types/algebric types
  [[http://www.webber-labs.com/wp-content/uploads/2015/08/mpl-11.pdf][Slides]]
  In C, the union is the closest to algebric types.

  Data constructors :: Labels
  Data Types :: constructors

** Datatype: union in ML
   New types can be defined using the keyword datatype.

   These declarations define both:
   – type constructors for making new (possibly
   polymorphic) types
   – data constructors for making values of those
   new types 

   We've seen two data structures: lists and tuples:

   Lists = nil | e * Lists

   In C, enumerations are like:

   #+BEGIN_SRC c
     #include <stdio.h>
     enum Dia {Mon = 3, Tue, Wed, Thu, Fri, Sat, Sun};
     int main () {
       printf("%d, %d, %d, %d, %d, %d, %d\n",
              Mon, Tue, Wed, Thu, Fri, Sat, Sun);
       printf("%d\n", Mon + Tue);
     }   
   #+END_SRC

   In ML:
  #+BEGIN_SRC sml
    datatype day = Mon | Tue | Wed | Thu | Fri | Sat | Sun;
    fun isWeekDay x = if not (x = Sat orelse x = Sun) then true else false ;
    isWeekDay Mon;
  #+END_SRC

  
#+RESULTS:
: val isWeekDay = fn : day -> bool
** Extint (of)
   To recover a data constructor’s parameters, use pattern matching. You can't do the same
   (pattern matching) with a function.
** Option - type constructors
   Is a polymorphic type. Used by predefined functions (or your own) when the result is
   not always defined
  #+BEGIN_SRC sml
    datatype 'a option = NONE | SOME of 'a;
  #+END_SRC
  
