notes.tex
\subsection{Strategies to discover types}
\label{sec:orgc087c43}
\begin{itemize}
\item Implicit: types are inferred.
\begin{itemize}
\item Inference: the compiler uses an algorithm that finds the correct type of
each value. Examples: Haskell, Scala, SML.
\item Special names: In some old languages, the name of the variable gives away
its type. Example: in old Fortran, integer variables should start with 'I'.
\end{itemize}
\item Explicit: syntax determines types.
\begin{itemize}
\item Annotations: the programmer must explicitly write the type of a symbol
next to it. Examples: Java, C, C++.
\end{itemize}
\end{itemize}

\subsection{Equivalence:}
\label{sec:org1f1d21e}
\begin{itemize}
\item name equivalence: two types are the same, if, and only if, they have the
same name: C, Java, C++, etc. Advantage: legibility.
\item structural equivalence: two types are the same if they have the same
structure. Example: SML. Advantage: reusability.
\end{itemize}

\subsection{Polymorfism}
\label{sec:org88970ce}
Python is way more reusable than C or SML. The secret to get closer to Python is
polymorfism. A function or operator is \textbf{polymorphic} if it has at least two possible
types.

Which statically typed language gets closer to python? Two types of polymorfism:
\begin{itemize}
\item ad-hoc (infinite symbols)
\item universal
\end{itemize}
\subsubsection{Ad-hoc}
\label{sec:orgfbe1ca6}
\begin{itemize}
\item Overload. Uses the types to choose the definition.
\item Coersion. Uses the definition to choose a type conversion.
\end{itemize}
\begin{enumerate}
\item Overload:
\label{sec:org409ffe4}
An overloaded function name or operator is one that has at least two definitions, all
of different types. Many languages have overloaded operators. There are languages
that allow the programmer to change the meaning of operators.

\item Coersion:
\label{sec:org34a7609}
A coercion is an implicit type conversion, supplied automatically even if the
programmer leaves it out.
\end{enumerate}
\subsubsection{Universal}
\label{sec:org580381b}
\begin{itemize}
\item Parametric
\item Subtyping
\end{itemize}
\begin{enumerate}
\item Subtyping:
\label{sec:org63a0f11}
Barbara Liskov's principle. Subtyping \textbf{isn't} the same as inheritance. Not the only
mecanism to create subptypes.
\end{enumerate}

\section{(02/09/19) Lambda calculus}
\label{sec:org27de7e1}
\subsection{Lambda expressions:}
\label{sec:org3ddc56b}

Each lambda declares a different name.

\begin{verbatim}
<expr> ::= <name>
      | \lambda <name> . <expr> |
      | <expr> <expr>           |

\end{verbatim}


\[(\lambda x \cdot x) \cdot w\], where


\begin{align*}     
  & x_0 = \text{formal parameter} \\
  & x_1 = \text{function body} \\
  & w   = \text{real parameters} \\
\end{align*}

\subsection{Numbers}
\label{sec:orgfb3ff3d}
A number is a function that takes a function s plus a constant z. The
number N is formed by applying s N times on z.
\begin{verbatim}
Zero = \s.\z.z
One = \s.\z.sz
Two = \s.\z.s(sz)
Three = \s.\z.s(s(sz))
\end{verbatim}
\section{(04/09/19) Currying and Higher order}
\label{sec:org2179ee2}
\subsection{Currying}
\label{sec:orgd23bcef}
Then it is not possible to implement a function which take multiple parameters? Of
course, it is possible, by a methodology called currying.In currying every function
takes only one argument and returns a function. While the last function in this series
will return the desired output.

\subsection{Anonymous Functions}
\label{sec:orga3d094a}
Starts with \emph{fn} (lambda functions). You can't do a recursive anonymous function because
it doesn't have a name. For you to do one, you need the \emph{y combinator}.

In SML, we can create anonymous functions, e.g: (fn x => x + 2) 3.

'fn' is the equivalent of lambdas in SML, e.g:
\x.x is equivalent to fn x => x

\begin{itemize}
\item val ZERO = fn s => fn z => z;
\item val ONE = fn s => fn z => s z;
\item val TWO = fn s => fn z => s (s z);
\item val THREE = fn s => fn z => s (s (s z));
\end{itemize}

\subsection{Higher Order}
\label{sec:org5e7a670}
Each function has an order:
\begin{itemize}
\item A function that does not take other functions as parameters, and does not return a
function value, has order 1
\item A function that takes a function as a parameter or returns a function value has order
n+1, where n is the order of its highest-order parameter or returned value
\end{itemize}
\begin{enumerate}
\item Foldr and Foldl
\label{sec:org71e939f}
Only return the same when operators are both associative and commutative.
\end{enumerate}
\section{(11/09/19) Data Types/algebric types}
\label{sec:org60b6ade}
\href{http://www.webber-labs.com/wp-content/uploads/2015/08/mpl-11.pdf}{Slides}
In C, the union is the closest to algebric types.

Data constructors :: Labels
Data Types :: constructors

\subsection{Datatype: union in ML}
\label{sec:org11d52cb}
New types can be defined using the keyword datatype.

These declarations define both:
– type constructors for making new (possibly
polymorphic) types
– data constructors for making values of those
new types 

We've seen two data structures: lists and tuples:

Lists = nil | e * Lists

In C, enumerations are like:

\begin{minted}[]{c}
#include <stdio.h>
enum Dia {Mon = 3, Tue, Wed, Thu, Fri, Sat, Sun};
int main () {
  printf("%d, %d, %d, %d, %d, %d, %d\n",
         Mon, Tue, Wed, Thu, Fri, Sat, Sun);
  printf("%d\n", Mon + Tue);
}   
\end{minted}

In ML:
\begin{minted}[]{sml}
datatype day = Mon | Tue | Wed | Thu | Fri | Sat | Sun;
fun isWeekDay x = if not (x = Sat orelse x = Sun) then true else false ;
isWeekDay Mon;
\end{minted}
\subsection{Extint (of)}
\label{sec:org6f627ca}
To recover a data constructor’s parameters, use pattern matching. You can't do the same
(pattern matching) with a function.
\subsection{Option - type constructors}
\label{sec:org3af8d46}
Is a polymorphic type. Used by predefined functions (or your own) when the result is
not always defined
\begin{minted}[]{sml}
datatype 'a option = NONE | SOME of 'a;
\end{minted}
