notes.org
* (19/09/19) Review
  - Ocaml and subtyping
  - Types of languages
  - Elixir and Erlang are on the same VM
  - h::t
  - Context-free: can only have a symbol on the left side of production and produce 0 or
    more things on the right side. Given a string, you can always say if a strig belongs,
    but can't determine wether it's ambiguous (can generate an infinite set of strings).
    - Tokens (terminals)
    - Non-terminals (variables)
    - Production rules
    - Start symbol
  - *Serious*: need to write grammar in prolog (attributes and no attributes). Ex: count number of constants.
  - There are two semantics aspects of languages (for binary operators):
    - Associativity: which operator to evaluate first (right or left).
    - Precedence
  - In ml, :: are associative to the right.
  - Turing Completes need loops.
  - Compile, interpret, and virtualize.
  - In javascript, the browser gets the source code (no binary code). Not x86.
  - Java is ASCII, bytecodes is a binary language executed in a hw called JVM.
  - Scala, clojure, kotlin, groov: jvm.
  - Tuples and lists are the only structures (actually tuples only).
  - List operations
  - The pogram with polynoms doesn't fall in the test
  - The one with the triangles might
  - six patterns in ml: variables, constants, lists, tuples, nil, h
  - Types are a set of values. Brainfuck and Forth don't have types. Type systems avoid some
    erros.
  - The cardinality of a type is the product of its types cardinalities.
  - Vectors are a multidimensional cartesian product of the same set (same type).
  - Tuples have different types
  - In ml, the union is the datatype.  The cardinality is the /sum/ of the cardinality of
    its types. The space occupied is the largest element's size.
  - Cartesians, Vectors, functions and unions.
  - Static examples: C, Java, /SML/, Cpp, Haskell. 
  - Dynamic examples: Python, Javascript, Lisp, PHP, Ruby.
  - Static vs Dyamic, Strongly vs Weak, Nominal vs Structurual, Inference vs annotation. Advantages of each one.
  - Coersion is like converting.
  - Advantage of weakly typed: performance.
  - There's a spectrum of dynamic to static typing.
  - There is a if then else in m.() in java, for example.
  - Types of polymorfirsm
  - Polymorfistm is about statically typed languages. It's point is to get statically typed to be more reusable.
  - hd function in ml, e.g, is polymorfic.
  - differnce in universal and ad-hoc.
  - VAI CAIR OCAML e subtyping.
  - Watch out with renaming in lambda-calculus (avoid variable captures).
  - Operations with church number, you gotta know how to do. No succ
    declaration. Implement add given succ. Convert church number to int.
  - Map, filter e fold.
  - Scope is a region where a symbol exists.
  - Almost every language is static scope.
  - *Bash* is the only dynamic que presta.
  - Two types of forming scope: blocks and namespaces.
  - A tree can be a tree or 2 elements plus a tree.
  - 
