notes.tex

\section{(19/09/19) Review}
\label{sec:org1dee997}
\begin{itemize}
\item Ocaml and subtyping
\item Types of languages
\item Elixir and Erlang are on the same VM
\item h::t
\item Context-free: can only have a symbol on the left side of production and produce 0 or
more things on the right side. Given a string, you can always say if a strig belongs,
but can't determine wether it's ambiguous (can generate an infinite set of strings).
\begin{itemize}
\item Tokens (terminals)
\item Non-terminals (variables)
\item Production rules
\item Start symbol
\end{itemize}
\item \textbf{Serious}: need to write grammar in prolog (attributes and no attributes). Ex: count number of constants.
\item There are two semantics aspects of languages (for binary operators):
\begin{itemize}
\item Associativity: which operator to evaluate first (right or left).
\item Precedence
\end{itemize}
\item[{In ml,}] are associative to the right.
\item Turing Completes need loops.
\item Compile, interpret, and virtualize.
\item In javascript, the browser gets the source code (no binary code). Not x86.
\item Java is ASCII, bytecodes is a binary language executed in a hw called JVM.
\item Scala, clojure, kotlin, groov: jvm.
\item Tuples and lists are the only structures (actually tuples only).
\item List operations
\item The pogram with polynoms doesn't fall in the test
\item The one with the triangles might
\item six patterns in ml: variables, constants, lists, tuples, nil, h
\item Types are a set of values. Brainfuck and Forth don't have types. Type systems avoid some
erros.
\item The cardinality of a type is the product of its types cardinalities.
\item Vectors are a multidimensional cartesian product of the same set (same type).
\item Tuples have different types
\item In ml, the union is the datatype.  The cardinality is the \emph{sum} of the cardinality of
its types. The space occupied is the largest element's size.
\item Cartesians, Vectors, functions and unions.
\item Static examples: C, Java, \emph{SML}, Cpp, Haskell.
\item Dynamic examples: Python, Javascript, Lisp, PHP, Ruby.
\item Static vs Dyamic, Strongly vs Weak, Nominal vs Structurual, Inference vs annotation. Advantages of each one.
\item Coersion is like converting.
\item Advantage of weakly typed: performance.
\item There's a spectrum of dynamic to static typing.
\item There is a if then else in m.() in java, for example.
\item Types of polymorfirsm
\item Polymorfistm is about statically typed languages. It's point is to get statically typed to be more reusable.
\item hd function in ml, e.g, is polymorfic.
\item differnce in universal and ad-hoc.
\item VAI CAIR OCAML e subtyping.
\item Watch out with renaming in lambda-calculus (avoid variable captures).
\item Operations with church number, you gotta know how to do. No succ
declaration. Implement add given succ. Convert church number to int.
\item Map, filter e fold.
\item Scope is a region where a symbol exists.
\item Almost every language is static scope.
\item \textbf{Bash} is the only dynamic que presta.
\item Two types of forming scope: blocks and namespaces.
\item A tree can be a tree or 2 elements plus a tree.
\item 
\end{itemize}
\end{document}
